Revit 2027 API
ConnectionValidationInfo.IsValidWarningIndex Method
 Validate warning index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidWarningIndex(
	int index
)
Public Function IsValidWarningIndex (
	index As Integer
) As Boolean
public:
bool IsValidWarningIndex(
	int index
)
member IsValidWarningIndex :
        index : int -> bool
Parameters
index Int32
Return Value
Boolean
See Also
Reference
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace